//===================================================================================================================================
//-------------------------------------------------- TASK HANDLEs para main.cpp ---------------------------------------------------------------------
//===================================================================================================================================


//======================================================= Task do display ========================================================== 
TaskHandle_t DisplayTask;

/// @brief Função que irá controlar o display pelos valores alterados pela função buttonTask(); e pelos valores da temperatura(e erro) alterados pela função loop(); 
void displayTask(void * pv);
//-----------------------------------------------------------------------------------------------------------------------------------

//======================================================= Task da Temperatura e Relay ========================================================== 
TaskHandle_t RelayTask;

/// @brief Função que irá controlar o relay e o led abaixo do display pelos valores alterados pela função buttonTask(); e pelos valores da temperatura(e erro) alterados pela função loop();
void relayControlTask(void * pv);
//-----------------------------------------------------------------------------------------------------------------------------------


//=================================================== Task dos Botões ==============================================================
TaskHandle_t ButtonTask;

/// @brief Função que irá alterar os valores de SetPoint e os estados de Power(ON/OFF) para a Função displayTask();
void buttonTask(void * pv);
//-----------------------------------------------------------------------------------------------------------------------------------

//=================================================== Task da Dimerização ==============================================================
TaskHandle_t BrightControll;

void brightControll(void * pv);
//-----------------------------------------------------------------------------------------------------------------------------------